import requests
import os
import datetime

# --- ПРОВЕРКА: запуск только раз в 2 недели ---
week_number = datetime.datetime.utcnow().isocalendar()[1]

if week_number % 2 != 0:
    print("Пропускаем эту неделю")
    exit()

print("Запускаем Manus")

# --- ТВОЙ API ---
MANUS_API_KEY = os.environ.get("MANUS_API_KEY")

PROMPT = """
«В самом начале работы сохрани BOT_TOKEN и CHANNEL_ID в файл /home/ubuntu/.env и используй его при необходимости. В отдельном файле сохрани шаблон поста в Telegram.»
Задача: Найди деловые мероприятия в России где участвуют топ-менеджеры (CEO, CFO, HRD, Генеральный директор, Финансовый директор, HR-директор). Интересуют ТОЛЬКО очные мероприятия в диапазоне сегодня +14 до +28 дней. По всей России.
Шаг 1 — Зайди на эти конкретные сайты организаторов и найди все мероприятия в диапазоне сегодня +14 до +28 дней:
https://quorumconference.ru/
https://www.pcg-event.com/
https://hrsummit.ru/
https://auditorium-cg.ru/
Шаг 2 — Дополнительно самостоятельно поищи в интернете деловые мероприятия в диапазоне сегодня +14 до +28 дней с участием топ-менеджеров. Используй поисковые запросы типа:
"форум генеральных директоров 2026"
"HR конференция (текущий месяц ) 2026 Россия"
"бизнес форум CEO CFO 2026"
"конференция директоров (текущий месяц) 2026"
Шаг 3 — Для каждого найденного мероприятия извлеки:
Название
Дата и время (в диапазоне сегодня +14 до +28 дней)
Город и место проведения
Список спикеров с должностями и компаниями
Ссылка на регистрацию
Краткое описание (2–3 предложения)
Шаг 4 — Поиск списка участников-компаний (ОБЯЗАТЕЛЬНЫЙ шаг для каждого мероприятия)
Для каждого найденного мероприятия выполни следующее:
4.1. Перейди на страницу мероприятия и целенаправленно ищи раздел или вкладку «Участники» / «Participants» / «Делегаты» / «Members» — это список компаний, которые зарегистрировались на мероприятие (пример формата: https://acra-forum.ru/events/220?tab=members ). Проверяй не только главную страницу, но и:
Подстраницы: /participants, /members, /delegates, /attendees, ?tab=members, ?tab=participants
Ссылки на внешние файлы (Google Docs, Яндекс.Диск, Excel, PDF)
Кнопки «Скачать список участников», «Список компаний»
4.2. Если список компаний-участников найден:
Собери все названия компаний
Сохрани в файл /home/ubuntu/participants_[название_мероприятия].csv (одна колонка: «Компания»)
Зафиксируй в отчёте: «✅ Список участников найден: N компаний»
4.3. Если список не найден:
Зафиксируй в отчёте: «❌ Список участников не опубликован»
НЕ пропускай этот шаг — отсутствие списка должно быть явно подтверждено после проверки всех подстраниц
Шаг 5 — Отфильтруй. Оставь только те мероприятия где:
Дата в диапазоне сегодня +14 до +28 дней
Формат очный (не онлайн-вебинар)
Среди спикеров есть: CEO, CFO, CTO, HRD, Генеральный директор, Финансовый директор, HR-директор, Коммерческий директор
Шаг 6 — Для каждого релевантного мероприятия оформи пост по шаблону:
Plain Text
(тут твой эмодзи который подходит под название)  [Название]
📅 Когда: [дата и время]
📍 Где: [город, площадка]
🏢 Организатор: [кто организатор]

👥 Ключевые спикеры:
  • [Имя] — [Должность], [Компания]
  • [Имя] — [Должность], [Компания]

💡 О чём: [краткое описание — 2–3 предложения]

[БЛОК УЧАСТНИКОВ — добавляется ТОЛЬКО если в Шаге 4 найден список компаний:]
🏢 Компании-участники ([N] зарегистрировано):
  • [Компания 1]
  • [Компания 2]
  ... (первые 10 компаний из списка)
  + ещё [M] компаний → [ссылка на полный список или файл]

🔗 Регистрация: [ссылка]

#мероприятие #нетворкинг #b2b
Шаг 7 — Отправь каждый пост в Telegram-канал через Bot API:
BOT_TOKEN: 8603518009:AAF7nZ9XrRtT53iisebLPxCzMR4QFeWDsQg
CHANNEL_ID: -1003956792779
Используй parse_mode=HTML, паузу 10 секунд между сообщениями
Если для мероприятия есть файл участников (/home/ubuntu/participants_*.csv) — отправь его отдельным сообщением сразу после поста через метод sendDocument, с подписью: «📎 Полный список компаний-участников: [Название мероприятия]»
Если файла нет — ничего дополнительно не отправляй
"""

url = "https://api.manus.ai/v1/tasks"

headers = {
    "accept": "application/json",
    "content-type": "application/json",
    "API_KEY": MANUS_API_KEY
}

data = {
    "prompt": PROMPT,
    "mode": "fast"
}

response = requests.post(url, json=data, headers=headers)

print(response.json())
